In [1]:
import pandas as pd
import numpy as np

In [97]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101],
       [107, 'J', 'A', 102],[108, 'o', 'A', 102], [109, 'h', 'A', 102], [110, 'n', 'A', 102]
       
       
       ]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [98]:
employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101
6  107      J          A        102
7  108      o          A        102
8  109      h          A        102
9  110      n          A        102

In [104]:
((employee.groupby("managerId").size()) >=5 ).reset_index()

#

   managerId      0
0        101   True
1        102  False

In [94]:
employee[employee["id"].isin(ids)] [["name"]]

Empty DataFrame
Columns: [name]
Index: []